artilleryTesting.yml
config:
  - target: 'http://localhost:3000'
    processor: "./generateRandomData.js"
    phases:
      - duration: 30
        arrivalRate: 10
        rampTo: 50
        name: "Initialize the testing"
scenarios:
  - name: "Get List of Reviews"
    flow:
      - get:
          url: "/reviews/{{ generateRandomProductId }}/list"